[
    {
        "name": "Xbox original",
        "price": "60",
        "category": "Consoles",
        "image":"xbox-console.jpg",
        "details":
        {
            "brand": "Microsoft",
            "description": "The first Xbox, released by Microsoft on November 15, 2001, marked the company's entry into the highly competitive video game console market. Designed to compete with established consoles like Sony's PlayStation 2 and Nintendo's GameCube, the original Xbox brought a new level of power and innovation to the gaming industry.",
            "year Released": "2001"
        }
    },

    {
        "name": "Xbox 360",
        "price": "100",
        "category": "Consoles",
        "image":"xbox360.jpg",
        "details":
        {
            "brand": "Microsoft",
            "description": "The Xbox 360, released by Microsoft on November 22, 2005, represents a significant milestone in the evolution of gaming consoles. Building upon the success and lessons learned from the original Xbox, the Xbox 360 introduced a range of innovations and features that contributed to its popularity and longevity in the gaming industry.",
            "year Released": "2005"
        }
    },

    {
        "name": "Xbox one ",
        "price": "200",
        "category": "Consoles",
        "image":"xbox-one,jpg",
        "details":
        {
            "brand": "Microsoft",
            "description": " The Xbox One, released in 2013, is a high-performance gaming console by Microsoft. Equipped with an 8-core CPU, advanced GPU, and 8 GB of RAM, it delivers impressive graphics and responsive gameplay. The redesigned controller enhances precision, and the Kinect sensor offers innovative features like voice commands. Doubling as a multimedia hub, it supports Blu-ray, streaming, and cable integration.  The Xbox One provides an immersive and comprehensive entertainment experience.",
            "year Released": "2013"
        }
    },

    {
        "name": "Xbox series X",
        "price": "500",
        "category": "Consoles",
        "image":"xbox-series-x.png",
        "details":
        {
            "brand": "Microsoft",
            "model": "The Xbox Series X, released in November 2020, is a powerhouse of gaming technology. Packed with an AMD processor, RDNA 2 GPU, and 16 GB of RAM, it delivers stunning 4K gaming at 60 fps (frames per second) and supports up to 120 fps. The console features a rapid NVMe SSD for quick load times and a spacious 1TB storage. The new Xbox Wireless Controller adds functionality, and the Series X maintains backward compatibility for a vast game library. With its sleek design and cutting-edge hardware, the Xbox Series X redefines the gaming experience.",
            "year Released":"2020"
        }
    },

  
    {
        "name": "Playstation",
        "price": "40",
        "category": "Consoles",
        "image":"ps1.jpg",
        "details":
        {
            "brand": "Sony",
            "description": "The original PlayStation, released in 1994, transformed the gaming landscape with its sleek design and powerful 32-bit processor. A pioneer in CD-ROM gaming, it brought iconic titles to life and set the stage for Sony's enduring impact on the industry.",
            "year Released": "1994"
        }
    },

    {
        "name": "Playstation 2",
        "price": "100",
        "category": "Consoles",
        "image":"ps2.jpg",
        "details":
        {
            "brand": "Sony",
            "description": "The PlayStation 2, released by Sony in 2000, redefined gaming with its sleek design and powerful capabilities. Its extensive game library and built-in DVD player made it a household entertainment staple, leaving a lasting mark on the gaming world.",
            "year Released": "2000"
        }
    },

    {
        "name": "Playstation Portable " ,
        "price": "60",
        "category": "Consoles",
        "image":"psp.jpg",
        "details":
        {
            "brand": "Sony",
            "description": "The PlayStation Portable (PSP), introduced by Sony in 2004, was a portable gaming revolution. With a sleek design, vibrant screen, and a vast library of games, it brought console-quality gaming on the go. The PSP remains a classic in handheld gaming history.",
            "year Released": "2004"
        }
    },

    {
        "name": "Playstation 3",
        "price": "150",
        "category": "Consoles",
        "image":"ps3.jpg",
        "details":
        {
            "brand": "Sony",
            "description": "The PlayStation 3 (PS3), released by Sony in 2006, was a gaming powerhouse with its sleek design and advanced Cell processor. Offering immersive high-definition gaming, a built-in Blu-ray player, and online multiplayer through PlayStation Network, the PS3 marked a significant leap forward in entertainment technology. Its diverse game catalog, solidified its status as a gaming icon.",
            "year Released": "2006"
        }
    },

    {
        "name": "Playstation 4",
        "price": "200",
        "category": "Consoles",
        "image":"ps4.jpg",
        "details":
        {
            "brand": "Sony",
            "description": " The PlayStation 4 (PS4), launched by Sony in 2013, revolutionized gaming with its sleek design and powerful hardware. Featuring an x86-64 AMD processor, it delivered stunning graphics and seamless gameplay. The PS4 introduced popular exclusive titles becoming a central hub for gaming and multimedia entertainment.",
            "year Released": "2013"
        }
    },

    {
        "name": "Playstation 5",
        "price": "500",
        "category": "Consoles",
        "image":"PS5.jpg",
        "details":
        {
            "brand": "Sony",
            "description": "The PlayStation 5 (PS5), released by Sony in 2020, redefines the gaming experience with its futuristic design and cutting-edge technology. Powered by a custom AMD processor and high-speed SSD, the PS5 delivers breathtaking graphics and ultra-fast loading times. With an innovative DualSense controller, adaptive triggers, and a compelling lineup of exclusive titles  the PS5 stands at the forefront of next-gen gaming",
            "year Released": "2020"
        }
    },

    {
        "name": "Ninetndo Gamecube",
        "price": "40",
        "category": "Consoles",
        "image":"gamecube.jpg",
        "details":
        {
            "brand": "nintendo",
            "description": " The Nintendo GameCube, released in 2001, brought a compact, cube-shaped design to the gaming world. With a unique optical disc format and a handle for portability, it introduced a new era of gaming for Nintendo. The GameCube featured beloved titles leaving a nostalgic mark on the gaming community.",
            "year Released": "2001"
        }
    },

    {
        "name": "Wii",
        "price": "150",
        "category": "Consoles",
        "image":"wii.jpg",
        "details":
        {
            "brand": "nintendo",
            "description": "The Nintendo Wii, launched in 2006, revolutionized gaming with its motion-sensing controls and inclusive gameplay. Featuring a compact design and the iconic Wii Remote, it appealed to a broad audience, including casual gamers. The Wii's standout titles showcased the console's innovative approach to interactive and social gaming experiences.",
            "year Released": "2006"
        }
    },

    {
        "name": "Ninetndo Switch",
        "price": "300",
        "category": "Consoles",
        "image":"switch.jpg",
        "details":
        {
            "brand": "nintendo",
            "description":  "The Nintendo Switch, introduced in 2017, redefines gaming with its unique hybrid design that seamlessly transitions between a home console and a portable handheld device. Boasting detachable Joy-Con controllers, a diverse game library, and the ability to dock for TV play, the Switch offers unparalleled versatility. With iconic titles the Nintendo Switch has become a staple in modern gaming.",
            "year Released": "2017 "
        }
    }
]
